## Spatial Data Science (GEO6119)

---

# Lab 2: Array and Data Frame (Part A)

<br>
Instructor: Yi Qiang (qiangy@usf.edu)<br>

### Please write or complete Python code to accomplish the tasks in questions. 

### Useful materials:
- Lecture slides ([lec2_array_dataframe.pptx](https://usflearn.instructure.com/courses/1649144/files/129563852/download?download_frd=1)) in Canvas
- [Example code in Lecture 2](https://github.com/qiang-yi/spatial_data_science/blob/main/Week2_Array_DataFrame.ipynb)
- [Numpy Array Cheatsheet](https://assets.datacamp.com/blog_assets/Numpy_Python_Cheat_Sheet.pdf)
- [Pandas DataFrame Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)

### Useful shortcuts for Jupyter Notebook

Some of my favorite shortcuts (in command mode):

- `ESC`: exit cell editing and enter to command mode
- `A`: add a cell above the current cell
- `B`: add a cell below the current cell
- `C`: copy the current cell
- `X`: cut the current cell
- `V`: paste the copied cell below the current cell
- `DD`: delete the current cell
- `M`: change cell to MarkDown code (must exit editing first)
- `Y`: change cell to Python code (must exit editing first)

---

## 1. Numpy Array

### Question 1 (0.5pt): Create a 4 × 5 array with random numbers between 0 and 1. Then count the total number of values that are greater than 0.5.

In [18]:
# Import the numpy library as np
import numpy as np

a = np.random.rand(4,5)
a[a>0.5].size

9

### Question 2 (2pt): Write lines of Python codes to complete the following steps

1. #### Create a 100×100 array with random numbers between 0 and 1.

In [19]:
a = np.random.rand(100,100)

2. #### Get the value in the 27th row and in the 5th column counting from the end.

In [20]:
a[26,-5]

0.12881525465921106

3. #### Calculate the mean and standard deviation of the array.

In [31]:
mean = a.mean()
print(mean)

0.49841718792512457

In [32]:
std = a.std()
print(std)

0.2864512194946537

4. #### Count the number of values that are equal or greater than the mean of the array.

In [33]:
a[a>=mean].size

4953

5. #### Get the subset of the array from the 34th row to 52th row, and from the 17th column to the 82th column.

In [40]:
a[33:52,16:82]

array([[0.26491834, 0.3442683 , 0.14360614, ..., 0.80690219, 0.32929649,
        0.74203165],
       [0.16649318, 0.73999277, 0.28388059, ..., 0.48397153, 0.77092266,
        0.24576768],
       [0.71470922, 0.55350601, 0.79444005, ..., 0.77525369, 0.26440816,
        0.73606516],
       ...,
       [0.6484658 , 0.8973351 , 0.00651437, ..., 0.9960623 , 0.51129313,
        0.51068815],
       [0.59265684, 0.00979684, 0.77476644, ..., 0.32864725, 0.89900189,
        0.61886296],
       [0.60209846, 0.84970228, 0.0907983 , ..., 0.20021047, 0.42929219,
        0.14877714]])

6. #### Calculate the summation of the subset array.

In [41]:
a[33:52,16:82].sum()

628.5803537397052

### Question 3 (0.5pt): Create a Pandas DataFrame for the following table

<img src="image/lab2_1.jpg" width="300" align="left">

In [44]:
# Import the Pandas library
import pandas as pd

# Create a DataFrame "df" to store the following table
df = pd.DataFrame(
    [[1, 337, 118,'Geography'],
    [2, 324, 107,'Environmental Science'],
    [3, 316, 104,'Geology'],
    [4, 322, 110,'Geology'],
    [5, 314, 103,'Geography']],
    columns=['Serial No.', 'GRE', 'Toefl','Program'])

df

   Serial No.  GRE  Toefl                Program
0           1  337    118              Geography
1           2  324    107  Environmental Science
2           3  316    104                Geology
3           4  322    110                Geology
4           5  314    103              Geography

### Question 4 (0.25pt): Preveiw the first 5 rows of the DataFrame created in Question 3

In [45]:
df.head()

   Serial No.  GRE  Toefl                Program
0           1  337    118              Geography
1           2  324    107  Environmental Science
2           3  316    104                Geology
3           4  322    110                Geology
4           5  314    103              Geography

### Question 5: Write a line of code to select students whose GRE score is greater than 320

In [46]:
df[df['GRE']>320]

   Serial No.  GRE  Toefl                Program
0           1  337    118              Geography
1           2  324    107  Environmental Science
3           4  322    110                Geology

### Question 6: Write a line of code to calculate the average Toefl score of Geography students whose GRE score is greater than 320

Standard answer:

In [50]:
df[(df['GRE']>320)&(df['Program']=='Geography')]['Toefl'].mean()

118.0

Since there is only one student meet the condition, you can just get the Toefl score of that student

In [58]:
df[(df['GRE']>320)&(df['Program']=='Geography')]['Toefl'][0]

118